function TOS(num) {
  const tos = [
    `                                       
        오드 서비스이용약관

    제1조(목적)

    오드 통합서비스이용약관은 회사가 다양한 맞춤 서비스를 제공함에 있어, 회사와 회원 간의 권리, 의무 및 책임 사항 등 을 규정함을 목적으로 합니다.

    제2조(정의)

    이 약관에서 사용하는 용어의 정의는 다음과 같습니다.

    1. 회사가 운영하는 사이트(향후 추가되거나 변경될 수 있음): 회사에서 공지하고 서비스를 제공하는 매체로서 기타 웹사이트 및 모바일 어플리케이션 및 모바일 웹 등을 포함합니다.
    
    2. \"서비스\"란, 회사가 제공하는 모임, 글쓰기, 행사, 그 외 프로필 등 회사가 제공하는 서비스 일체를 말합니다. 서비스는 정보통신설비를 이용하여 재화 및 용역을 거래할 수 있도록 설정한 가상의 영업장을 포함합니다. 서비스는 각 서비스 내부에서 보여지는 게시물, 기능, 재화, 용역 등을 모두 포함하 며, 이와 관련된 사항과 정보 또한 모두 포함합니다. 

    3. \"회원\"이란, 회사가 제공하는 서비스에 접속하여 본 약관을 동의하고 가입 및 인증 후 서비스를 제공받는 자를 말합니다. 이하에서 정의되는 이용자와 호스트를 통칭합니다.

    4. \"아이디\"란, 회원의 식별과 서비스 이용을 위하여 회원이 정하고 회사가 승인하는 문자 또는 문자와 숫자의 조합을 의 미합니다. 

    5. \"프로필\"이란 회원이 서비스 내에서 활동하기 위해 만든 임의의 프로필로, 관심사 정보와 관심지역, 학교 등 간략한 소개가 포함됩니다. 

    6. \"게시물\"이란, 회원이 서비스를 이용함에 있어 서비스에 게시한 모든 부호·문자·음성·음향·화상·동영상 등의 정보 형태의 글, 사진, 동영상, 채팅 메시지 및 각종 파일과 링크 등을 의미합니다. 

    7. \"그룹핑\"이란, 회사에서 제공하는 서비스 \"게더링\"과 \"이벤트\"를 통칭하는 의미입니다.

    8. \"게더링\"란, 회사의 서비스를 통해 회원이 직접 만든 모임으로 한 명 이상의 회원들과 모여 자유롭게 관심사를 공유하고 온 오프라인 상에서 친목을 도모할 수 있도록 회사가 제공하는 서비스를 의미합니다. 게더링은 리스트형식, 맵 형식의 2가지 UI형태로 서비스를 제공합니다.

    9. \"이벤트\"란, 회사의 서비스를 통해 다양한 온오프라인 행사들을 공유하고 온오프라인 상에서 친목을 도모할 수 있도록 회사가 제공하는 서비스를 의미합니다. 이벤트는 리스트형식 , 맵 형식의 2가지 UI형태로 서비스를 제공합니다.

    10. \"같이가기\"란, 회사가 제공하는 서비스인 \"이벤트\" 중에서 참여하고 싶은 이용자들이 만나서 같이 참여할 수 있도록 제공하는 서비스를 의미합니다.

    11. \"팔로우\"란 오드 커뮤니티에서 다른 유저에게 행할 수 있는 동작 기능으로, 친구인 이용자 소식을 친구인 이용자에게만 공개하기, 1:1 채팅 등 특수 기능을 이용할 수 있습니다. 

    12. \"게더링 규칙\" 이란 오드 커뮤니티 내에서 \"게더링\"을 통해 다른 회원을 만날 때 지켜야 하는 내부 규약입니다. 

    13. \"채팅방\"은 게더링, 이벤트 내 같이가기 기능을 통해 호스트가 개설할 시 호스트가 승인한 참여자들과 소통할 수 있는 채팅방을 의미합니다. 

    제3조(약관의 게시와 개정)

    1. 회사는 회사의 모든 약관과 법령에 따라 명시해야 하는 정보가 있을 경우, 서비스 하단,더보기, 마이페이지, 그 외 기타 메뉴, 팝업, 배너 등에 게시할 수 있습니다. 

    2. 회사는 관련법을 위배하지 않는 범위에서 본 약관을 개정 할 수 있습니다.

    3. 회사가 약관을 개정할 경우에는 적용일자 및 개정사유를 명시하여 현행 약관과 함께 사이트 초기화면에 최소 적용일자 7일 이전부터 적용일자 전일까지 공지합니다. 다만, 회원의 권리, 의무에 중대한 영향을 주는 변경이 이루어질 경우에는 적용일자 30일 이전분터 공지합니다.

    4. 제 3항에 따라 공지된 적용일자 이후에 회원이 회사의 서비스를 계속 이용하는 경우에는 개정된 약관에 동의하는 것으로 간주합니다. 약관에 동의하지 아니하는 회원은 언제든지 자유롭게 서비스 이용계약을 해지할 수 있습니다.

    5. 회사는 유료 서비스 및 개별 서비스에 대해서는 별도의 이용약관 및 정책을 둘 수 있으며, 해당 내용이 이 약관과 상충할 경우 더 우선시 할 수 있습니다.

    6. 본 약관의 일부가 집행 불능으로 판단되더라도 나머지 부분은 계속해서 효력을 갖습니다.

    제4조(서비스 이용 계약 등)

    1. 회원이 되고자 하는 자는 회사가 정한 가입 양식에 따라 회원정보를 입력하고 각 약관을 동의한 후 동의 버튼을 누르는 방법으로 회원 가입을 신청합니다.

    2. 회원가입신청의 성립은 회사의 승낙이 가입 신청자에게 도달한 시점으로 합니다. 

    3. 회사는 제1항과 같이 회원으로 가입할 것을 신청한 자에게 서비스 이용을 승낙함을 원칙으로 합니다. 다만, 다음 각호에 해당하는 경우, 별도의 통보 없이 회원가입을 거부하거나 이용 계약을 해지할 수 있습니다. 

    1) 각 약관을 준수하지 않거나 각 약관에 의해 가입 신청자가 회원 자격을 상실한 적이 있을 경우 

    2) 기타 회원으로 등록하는 것이 부적절하다고 판단되는 경우

    3) 회사에 의하여 이용계약이 해지된 날로부터 3개월 이내에 재이용을 신청하는 경우

    4) 부정한 용도 또는 영리를 추구할 목적으로 본 서비스를 이용하고자 하는 경우

    5) 이 약관 또는 관련 법령을 위반한 경우

    6) 이전에 동일 또는 유사한 아이디 , 다른 아이디를 통하여 부정한 사용을 한 이력이 있거나 의심되는 경우

    7) 관련 법령에 위배되거나 사회의 안녕질서 혹은 미풍양속을 저해할 수 있는 목적으로 신청한 경우

    8) 회사의 서비스 운영에 따른 설비에 여유가 없거나, 기술 상 지장이 발생하였거나 발생할 가능성이 있는 경우

    9) 만 14세 미만의 아동이 법정대리인(부모 등)의 동의를 얻지 아니한 이용신청을 하는 경우

    10) 회원이 회사나 다른 회원, 기타 타인의 권리나 명예, 신용, 기타 정당한 이익을 침해하는 행위를 한 경우

    11) 회사가 제공하는 각 약관 내지 관련 법령에 위배되거나 위배될 가능성이 있는 부당한 이용신청임이 확인된 경우

    12) 기타 회원과의 계속적 거래관계를 지속하기 어렵다고 합리적으로 판단되는 경우

    4. 전항 제 4호에 따라 부정한 용도 또는 영리를 추구할 목적으로 본 서비스를 이용하였거나, 제 6호에 따라 부정한 사용을 한 이력이 있는 경우 해당 위반사유가 발생한 시점에 제7조 제 1항에 따른 해지의 의사표시가 있었던 것으로 보아 계약이 자동종료 됩니다.

    5. 회사는 부정사용방지 및 본인확인을 위해 제휴기관을 통한 실명확인 및 본인인증을 요청할 수 있습니다.

    6. 회사는 회원의 개인정보 및 서비스 이용 기록(위치인증, 학교 메일 인증 등)에 따라 서비스 이용에 차이를 둘 수 있습니다. 

    7. 회사는 회원이 서비스를 이용하는 도중, 연속하여 1년 동안 서비스를 이용하기 위해 로그인 기록이 없는 경우 회원자격을 박탈할 수 있습니다.

    제5조(회원의 의무)

    1. 회원이 서비스를 이용하는 것은 회원이 적용 가능한 모든 법률, 규범 및 규정을 준수함에 동의하는 것입니다. 또한 회원은 서비스 이용을 규정하는 특정 추가 규범(이하 행동 규범)을 준수함에 동의합니다. 행동 규범은 모든 내용을 담고 있는 것은 아니며, 회사는 특정 행동이 금지 목록에 있는지에 관계없이 서비스의 완전함과 속성을 보호하기 위해 (회원에게 통지 하고) 환불, 영구 정지를 포함한 적합한 징계조치를 취할 수 있음은 물론 언제라도 이 행동 규범을 수정할 권한을 보유합니다. 이러한 행동 규범 외에도, 모범적인 서비스 이용행동 및 제재조치들에 대한 자세한 안내는 서비스 내에 공지된 회원 규율 및 운영정책을 참고하십시오.
    다음은 제재 조치가 따르는 행동의 예시를 나열한 것으로 이에 국한되지 않습니다. 

    - 신청 또는 변경 시 허위 기재, 기재 누락, 오기, 도용 행위 

    - 회사 및 제3자의 명예를 손상시키거나 업무를 방해하는 행위

    - 회사의 모든 재산에 대한 침해 행위 

    - 회사의 서비스 이외의 허가하지 않은 행위 

    - 회사의 직원 또는 서비스 관리자를 사칭하는 행위 

    - 서비스 내 게시물 및 자료를 허가 없이 이용, 변조, 삭제 및 외부로 유출하는 행위

    - 타인의 개인정보 및 계정을 수집, 저장, 공개, 이용하거나 자 신과 타인의 개인정보를 제3자에게 공개, 양도하는 행위 

    - 다중 계정을 생성 및 이용하는 행위 

    - 허가되지 않은 상업적 행위 

    - 통합개인정보보호약관 등 회원이 동의한 모든 약관에 대해 따르지 않는 행위 

    - 통합커뮤니티이용규칙에 어긋나는 행위

    - 현행법에 어긋나거나 서비스 제공에 있어 부적절하다고 판단되는 행위

    2. 회원은 회원가입신청을 한 시점의 정보와 현재의 정보가 다를 경우 즉시 변경사항을 정정해야 합니다. 

    3. 회사의 서비스 관련설비와 관련된 기술상 또는 업무상 문제 가 있는 경우에 승낙이 유보될 수 있습니다. 

    4. 회사가 관계 법령 및 각 약관에 의해서 책임을 지는 경우를 제외하고, 자신의 개인정보에 관한 관리책임
    은 각 회원에게 있으므로, 부정 사용되지 않도록 관리해야 합니다. 

    5. 회원은 아이디 및 비밀번호가 도용되거나 제3자가 사용하고 있음을 인지한 경우 이를 즉시 회사에 통지하고, 회사의 안 내에 따라야 합니다. 

    6. 제4항의 경우에 해당 회원이 회사에 그 사실을 통지하지 않거나, 통지한 경우에도 회사의 안내에 따르지 않아 발생한 불이익에 대하여 회사는 책임지지 않습니다. 

    7. 회사는 회원의 아이디가 개인정보 유출 우려가 있거나, 반 사회적 또는 미풍양속에 어긋나거나 회사 및 회사의 운영자로 오인될 우려가 있는 경우, 해당 아이디의 이용
    을 제한할 수 있습니다. 

    8. 회원은 서비스를 이용함에 있어 회사의 각 약관을 준수하지 않거나 의무를 다하지 않아 회사나 다른 회원이 손해를 입을 경우, 그 손해를 배상할 책임이 있습니다.

    제6조 (회원정보의 변경)

    1. 회원은 서비스내 마이페이지를 통하여 언제든지 본인의 개인 정보를 열람하고 수정할 수 있습니다. 

    다만, 서비스 관리를 위 해 필요한 단말기 식별번호 (디바이스 아이디 또는 IMEI), 전화번호, 아이디, 생년월일, 학교, 학과 등은 수정이 불가능합니다. 

    - 오류 또는 잘못된 오기입으로 인해 다른 정보를 입력한 경우 문의하기를 통해서 관리자가 승인을 통해 수정할 수 있습니다.

    2. 회사는 서비스 관련설비와 관련해 기술상 또는 업무상 문제로 프로필이 바로 변경되지 않을 수 있으며 이로 발생한 불이익에 대하여 회사는 책임지지 않습니다.

    제7조(이용계약 해지)

    1. 회원의 해지

    1) 회원은 언제든지 \"탈퇴\"를 통해 이용계약 해지 신청을 할 수 있으며, 회사는 관련법 등이 정하는 바에 따라 이를 즉시 처리하여야 합니다. 

    2) 회원이 이용계약을 해지할 경우, 관련법 및 통합개인정보 보호약관에 따라 모든 개인정보가 처리됩니다. 
    - 회원이 자발적으로 탈퇴를 한 경우 1달 이내 재가입이 불가능합니다. 
    - 약관 위반으로 회사에 의해 서비스 이용 제한이 되는 경우 6 달 이내 재가입이 불가능합니다.  

    3) 회원이 이용계약을 해지하더라도, 서비스 이용 시 작성하거나 만들어진 모든 게시물은 삭제되지 않습니다. 

    4) 회원이 이용계약을 해지한 뒤 새로 가입한 경우, 해지한 계정의 게시물 권한 등 모든 권리는 이양되지 않습니다.

    2. 회사의 해지

    1) 회사는 회원에게 제5조 2항에서 정하고 있는 이용계약의 해지사유가 있는 경우 회원과의 이용계약을 해지할 수 있습니다.

    2) 회사는 해당 회원에게 14일 이내의 기간을 정하여 사전에 해지사유에 대한 의견진술의 기회를 부여할 수 있습니다.

    제8조(이용 제한 등)

    1. 회사는 회원이 이 약관의 의무를 위반하거나 서비스의 정상적인 운영을 방해한 경우, 주의, 경고, 일시정지, 영구이용정지, 계약해지 등의 조치를 즉시 취할 수 있으며, 회원은 법적책임을 부담합니다. 다만, 아래 제3호 내지 제10호의 경우에는 회복할 수 없는 손해를 방지하기 위하여 회원에 대한 별도 경고 없이 즉시 일시정지 조치를 할 수 있으며, 중대한 범죄와 관련된다고 판단되는 경우 민형사상 조치와 함께 회원자격의 영구이용정지 조치를 통해 서비스 이용을 제한할 수 있습니다.
    1) 가입 신청 시 허위 내용을 등록한 경우
    2) 물품 또는 서비스에 대한 대금 결제, 기타 서비스 이용과 관련하여 회원이 부담하는 채무를 기일에 이행하지 않는 경우
    3) 타인의 서비스 이용을 방해하거나 정보를 도용하는 등 전자상거래 질서를 위협하는 경우
    4) 회사를 이용하여 법령과 이 약관이 금지하거나 공공질서, 미풍양속에 반하는 행위를 하는 경우
    5) 회원이 구매한 물품을 고의로 훼손한 후 교환, 환불 등의 보상을 요구한 사실이 확인되는 경우
    6) 회원이 물품 또는 서비스 구매 시 결제 정보를 임의로 조작하여 정상 결제가격보다 못 미치는 금액을 결제한 경우
    7) 이용자가 회사 시스템이나 서비스를 경유하지 않고 호스트에게 대가를 직접 지급한 경우
    10) 호스트에게 불쾌한 언어사용, 비정상적인 행위 등을 한 것에 대하여 신고가 접수된 경우
    11) 고객센터 문의 및 전화 상담 내용이 욕설, 폭언, 성희롱, 반복 민원을 통한 업무방해 등에 해당하는 경우

    2. 회사는 \"주민등록법\"을 위반한 명의도용 및 결제도용, 본인이 아닌 프로필사진 기재 및 도용, 전화번호 도용, \"저작권법\"을 위반한 불법프로그램의 제공 및 운영방해, 정보통신망, \"정보통신망 이용촉진 및 정보보호 등에 관한 법률\"을 위반한 불법통신 및 해킹, 프로그램의 배포, 접속권한 초과행위, \"여신전문 금융업법\"을 위반한 \"이용자\"의 신용카드 부정거래 등 이와 유사한 형태의 부정행위 등과 같이 관련법을 위반한 경우에는 주의, 경고, 일시정지, 영구 이용정지, 계약해지 등의 조치를 즉시 취할 수 있으며, 회원은 법적책임을 부담할 수 있습니다. 
    3. 회사는 회원이 계속해서 1년 이상 로그인하지 않는 경우, 회원정보의 보호 및 운영의 효율성을 위해 별도로 분리 보관하여 관리하며, 구체적인 파기 등 절차에 대하여는 개인정보 보호법 등 해당 시점에 유효하게 적용되는 법령의 절차에 따릅니다.
    4. 본 조의 이용제한 범위 내에서 제한의 조건 및 세부내용은 회사의 이용제한정책에서 정하는 바에 의합니다. 

    5. 회원은 본 조에 따른 이용제한 등에 대해 회사가 정한 절차 에 따라 이의신청을 할 수 있습니다. 이 때 이의가 정당하다고 회사가 인정하는 경우 회사는 즉시 서비스의 이용을 재개합니다.
    6. 본 조에 따라 이용제한이 되는 경우 서비스 이용을 통해 획 득한 혜택 등도 모두 이용중
    단, 또는 소멸되며, 회사는 이에 대해 별도로 보상하지 않습니다.

    제9조(회원의 이메일 및 비밀번호에 대한 의무)
    1. 회원은 자신의 이메일과 비밀번호에 관한 관리책임이 있으며 이를 소홀히 하여 발생한 모든 민형사상의 책임은 회사의 고의 또는 중과실이 없는 한 회원 자신에게 있습니다. 회원은 자신의 이메일 및 비밀번호를 제3자에게 알려주어서는 안되며, 회원이 이메일과 비밀번호를 제 3자에게 알려줌으로써 발생한 손해에 대해서 회사는 책임을지지 않습니다. 이메일과 비밀번호가 회원의 의사에 반하여 유출되거나 기타의 사정으로 제3자가 사용하고 있음을 인지하는 경우 즉시 비밀번호를 변경하여야 하고, 회사에 통보한 다음 회사의 안내를 따라야합니다. 이를 소홀히 하여 발생한 모든 책임은 회원이 집니다.
    2. 회원의 자신의 이메일 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
    3. 회원이 자신의 이메일 및 비밀번호를 도난당하거나 제3자가 이용하고 있음을 인지한 경우에는 즉시 회사에 통보하고, 회사의 조치가 있는 경우에는 그에 따라야합니다.
    4. 회원이 제3항에 따른 통지를 하지 않거나 회사의 조치에 응하지 아니하여 발생하는 모든 불이익에 대한 책임은 회원에게 있습니다.

    제10조(회사의 의무)
    1. 회사는 관련법령과 이 약관이 금지하거나 공공질서, 미풍양속에 반하는 행위를 하지 않으며, 이 약관이 정하는 바에 따라 지속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여야 합니다.
    2. 회사는 회원이 안전하게 서비스를 이용할 수 있도록 회원의 개인정보(신용정보 포함) 보호를 위한 보안 시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수합니다.
    3. 회사는 관련법령이 정한 의무사항을 준수합니다.


    제11조(회원에 대한 통지 등)
    1. 회사가 특정 회원에 대해 통지를 하는 경우, 회원의 개인정보와 서비스 내부 수단을 사용할 수 있습니다. 
    2. 회원 전체에 대한 통지의 경우, 공지사항에 게시함으로써 제1항의 통지에 대신할 수 있습니다. 
    3. 회원이 30일 이내에 의사 표시를 하지 않은 경우, 회원이 통지 내용에 대해 동의한 것으로 간주합니다.

    제12조(서비스 및 약정의 제공, 변경, 중단, 철회)
    1. 회사는 회사가 자체 개발하거나 다른 회사와의 협력을 통해 회원들에게 제공할 일체의 서비스를 제공합니다. 
    2. 회원은 서비스에서 제공하는 기능을 이용하여 재화 및 용역을 구매하거나, 모임 등에 참여할 때, 승인, 버튼을 누르는 방식 등으로 동의 의사를 표현하여 약정을 체결할 수 있습니다. 
    3. 서비스를 이용하거나 약정을 체결할 경우, 서비스를 이용하거나 약정을 체결하기까지 명시된 모든 내용에 동의한 것으로 봅니다.


제13조(저작권의 귀속)
    1. 회사가 작성한 게시물에 대한 권리는 회사에게 귀속됩니다. 그러므로 회원은 서비스를 이용함으로써 얻은 정보를 회사의 사전 승낙 없이 임의로 복제, 전송, 출판, 배포 등 영리 목적으로 이용하거나 제3자에게 제공할 수 없습니다. 
    2. 회원이 작성한 게시물에 대한 권리는 회원에게 귀속됩니다. 단, 회사는 서비스의 운영, 확장, 홍보 등의 필요한 목적으로 회원의 저작물을 합리적이고 필요한 범위 내에서 별도의 허락 없이 수정하여 무상으로 사용하거나 제휴사에게 제공할수 있습니다. 이 경우, 개인정보는 절대 제공하지 않습니다. 
   
    3. 회사는 제2항 이외의 방법으로 회원의 게시물을 이용할 경 우, 회원의 개인정보와 서비스 내부 수단을 이용하여 회원의 동의를 받아야 합니다.


제14조(개인정보보호)

    1. 회사는 회원의 개인정보를 보호하기 위하여 개인정보 보호법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 등 관계 법령에서 정하는 바를 준수합니다.

    2. 회사는 회원의 개인정보를 보호하기 위하여 개인정보 처리방침을 제정, 서비스 초기화면에 게시합니다. 다만, 개인정보 처리방침의 구체적인 내용은 연결화면을 통하여 볼 수 있습니다.

    3. 회사는 이용계약을 위하여 회원이 제공한 정보를 회사의 서비스 운영을 위한 목적 이외의 용도로 사용하거나 회원의 동의 없이 제 3자에게 제공하지 않습니다. 단, 다음 각 호의 경우에는 예외로 합니다.

    1) 법령에 근거하여 회원업오의 이용과 제 3자에 대한 정보제공이 허용되는 경우

    2) 물품 배송업무 등 거래 이행에 필요한 최소한의 회원정보(성명, 주소, 연락처 등)을 배송업체에 알려주는 경우

    3) 기타 회사의 약관 및 정책에 따라 회원의 동의를 구한 경우

    4) 회사는 개인정보 처리방침에 따라 회원의 개인정보를 최대한 보호하기 위하여 노력합니다.


    제11조(게시물 및 커뮤니티의 관리)
    1. 회원이 관련법 및 각 약관에 위배되는 내용의 커뮤니티를 개설하거나 게시물을 게시할 경우, 회사는 해당 서비스, 커뮤 니티 또는 게시물을 임의로 삭제, 중단, 변경 등의 조치를 할 수 있고 회원의 자격 및 권한을 제한, 정지 및 박탈할 수 있습 니다. 

    2. 회원의 게시물로 인한 법률상 이익 침해를 근거로, 다른 회 원 또는 제3자가 회원 또는 회사를 대상으로 하여 민형사상의 법적 조치를 취하거나 관련된 게시물의 삭제를 요청하는 경 우, 회사는 관련 게시물에 대한 접근을 잠정적으로 제한할 수 있습니다.

    제12조 오드의 오드 앱 서비스 개별 커뮤니티 이용규칙

    1. 오드 커뮤니티는 회원이 직접 만들어가는 공간입니다. 

    - 오드 커뮤니티는 회원분들의 자정능력을 존중합니다. 깨끗한 커뮤니티를 위해 노력해주시기 바랍니다. 
    
    - 회원은 서로 예의를 지키고, 존중해야 합니다.
    
    2. 다음 목록에 해당하는 게시물의 게시, 댓글 작성, 모임 생성, 개설을 금지하고있습니다. 
    
    - 욕설, 비아냥, 비속어 등 예의범절에 벗어난 게시물 
    
    - 혐오스럽거나 타 회원을 놀라게 하는 게시물 
    
    - 성적 비하를 포함하는 게시물 
    
    - 불건전한 만남, 대화, 통화 등을 목적으로 하는 게시물 
    
    - 특정인이나 단체/지역 등을 비방하는 게시물 
    
    - 중복글, 도배글, 낚시글, 내용 없는 게시물 
    
    - 익명을 악용한 여론 조작 
    
    - 관련법에 위배되거나, 타인의 권리를 침해하는 게시물(초상권, 저작권 등) 
    
    - 허가되지 않은 광고/홍보물 또는 상업적 게시물(타 서비스 및 사이트, 공동구매, 홍보성 모임 등) 
    
    - 논란 및 분란을 일으킬 수 있는 게시물 
    
    - 청소년유해매체물, 외설, 음란물, 음담패설, 신체사진 
    
    - 관리자를 사칭하는 게시물 
    
    - 기타 부적합한 게시물
    
    3. 다음 목록에 해당하는 규칙을 모두 지켜야 합니다. 
    
    - 각종 게시판의 게시물, 모임 상세내용, 채팅방, 복사, 스크린샷 등을 통해 절대 외부로 유출해서는 안됩니다.
    
    - 타인의 개인정보 및 계정을 수집, 저장, 공개, 이용하거나, 자신의 개인정보 및 계정을 공개, 공유해서는 안 됩니다. 
    
    - 회원이 관련법 및 각 약관에 위배되는 내용의 게시판을 개설하거나 게시물을 게시할 경우, 삭제, 중단, 변경 등의 제재가 가해질 수 있으며, 회원은 자격 및 권한을 제한, 정지, 박탈당 할 수 있습니다.
    
    4. 회원 및 게시물 신고 제도 
    
    - 커뮤니티 이용규칙에 어긋난다고 생각하는 게시물은 신고 버튼을 이용하여 신고해주시기 바랍니다. 
    
    - 모든 신고는 자동신고시스템을 통해 회사가 검토한 후 처리됩니다. 회원의 요청에 따라 게시물을 삭제하지 않습니다. 
    
    - 신고가 누적된 회원은 접근 제한 등의 제재가 가해질 수 있습니다. 
    
    - 관리자는 해당유저가 다른 유저들로부터 받은 신고가 합당하다고 판단되고, 3회 이상 누적된 경우 계정 영구정지 등의 강력조치를 취할 수 있습니다.
    
    - 신고 제도를 악용할 경우, 해당 신고는 처리되지 않습니다. 신고 제도를 악용한 회원은 제재가 가해질 수 있습니다.
    
    - 모임 내 불건전한 발언 및 행동에 대해서 사실을 증명할 수 있는 자료를 같이 보내주셔야 해당 회원에 대해 제재가 주어집니다.
    
    5. 허위사실 유포 및 명예훼손 게시물에 대한 게시중단 요청 - 허위사실 유포 및 명예훼손 등 권리를 침해하는 게시물의 게시중단을 원하실 경우, 고객센터로 연락을 하셔서 게시중단 요청을 전달주시기 바랍니다. 연락은 deso@oddhem.com으로 가능합니다.
    
    - 게시중단 요청 시 사실을 증명할 수 있는 자료(스크린 샷 등) 를 같이 보내주셔야 합니다.
    
    - 게시중단 요청은 담당자를 통해 접수된 순서에 따라 처리됩니다. 
    
    - 허위사실 유포 및 명예 훼손에 해당하지 않는다고 판단되는 경우, 해당 게시물은 게시중단 처리되지 않습니다.
    
    6. 기타 
    
    - 자유홍보게시판 등 일부 게시판은 게시판 이용 규칙에 따라 글 작성 1시간 이후부터 3일 동안은 작성한 글을 삭제할 수 없습니다.

    제14조(광고의 게재 및 발신)
    
    1. 회사가 회원에게 서비스를 제공할 수 있는 투자기반의 일부는 광고게재를 통한 수익에서 나옵니다. 회사는 회원이 등록한 게시물이나 그 내용을 활용한 광고게재 및 기타 서비스를 이용하면서 노출되는 광고를 게재할 수 있습니다. 
    
    2. 회사는 회원이 광고성 정보 수신에 동의할 경우, 이메일, 푸시 알림, 1:1 대화, 문자 메시지 등 전자적 매체를 이용하여 광고성 정보를 발신할 수 있습니다.

    제17조(면책조항)

    1. 회사는 다음의 경우, 어떠한 경우라도 책임을 지거나 보상 을 하지 않으며, 회원에게 귀책사유가 있을 경우, 별도의 통보 없이 자격을 제한, 정지 및 박탈할 수 있습니다. 
    
    - 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우 
    
    - 회사가 무료로 제공하는 서비스가 변경, 중단되거나 장애가 생길 경우 
    
    - 회사가 고의·과실이 없음을 입증할 경우
    
    - 회원의 작성한 게시물에 대한 정보, 자료, 신뢰도, 정확성 등 에 대해 
    
    - 오프라인 모임에서의 회원 간이나 회원과 광고주 등 제3자 상호 간에 합의한 거래 등에 대해 
    
    - 회원이 서비스를 이용함에 있어 회사의 각 약관을 준수하지 않거나 의무를 다하지 않을 경우 
    
    2. 회사는 제1항 외 귀책사유로 인하여 재화 및 용역을 구매 한 회원에게 법률적으로 인과관계를 밝힐 수 있는 손해가 발생하는 경우에는 그 손해를 배상할 책임이 있습니다.

    제18조(분쟁해결)

    1. 회사는 회원이 제기하는 문의, 정당한 의견 및 불만을 반영 및 처리하고 그 피해를 보상처리하기 위하여 상담창구를 운영합니다. 
    
    2. 회사와 회원 간에 발생한 전자상거래 분쟁과 관련하여 회원의 피해구제신청이 있는 경우에는 공정거래위원회 또는 시 도지사가 의뢰하는 분쟁조정기관의 조정에 따를 수 있습니다.

    제19조(재판관할)
    
    1. 회사와 회원 간 제기된 소송은 대한민국법을 준거법으로 하며, 관할 법원에 제소합니다.

    2. 회사와 회원 간 발생한 분쟁에 관한 소송은 제소 당시 회원의 주소에 의하고, 주소가 없는 경우 거소를 관할하는 지방법원의 전속관할로 합니다. 단, 제소 당시 회원의 주소 또는 거소가 명확하지 아니한 경우의 관할법원은 민사
    소송법에 따라 정합니다. 

    3. 해외에 주소나 거소가 있는 회원의 경우, 회사와 회원간 발생한 분쟁에 관한 소송은 전항에도 불구하고 대한민국 서울중앙지방법원을 관할 법원으로 합니다.

    제20조(위치기반서비스)

    오드는 사용자가 쉽고 편하게 타 사용자와의 교류 기회를 가 질 수 있도록 돕기 위해 오드 서비스에 위치기반서비스를 포함시킬 수 있습니다. 오드의 위치기반서비스는 사용자의 단 말기기의 위치정보를 수집하는 위치정보사업자로부터 위치 정보를 전달받아 제공하는 무료서비스이며, 구체적으로는 사용자의 현재 위치를 기준으로 특정 지역(천안, 아산 등 시단위)에 가입자격을 부여하고 다른 이용자와 해당 지역과 관련된 모임 또는 게시물을 작성할 수 있도록 하는 서비스(소셜네트워킹서비스), 사용자의 현재 위치를 이용한 생활 정 보나 광고성 정보를 제공하는 서비스(정보제공서비스)가 있습니다. 오드는 위치정보의 보호 및 이용 등에 관한 법률의 규정에 따라 개인위치정보 및 위치 정보 이용·제공사실 확인자료를 6개월 이상 보관하며, 사용자가 동의의 전부 또는 일부를 철회한 때에는 오드는 철회한 부분에 해당하는 개인위치정보 및 위치정보 이용·제공사실 확인 자료를 지체 없이 파기하겠습니다. 만약, 오드가 사용자의 개인위치정보를 사용자가 지정하는 제3자에게 직접 제공하는 때에는 법령에 따라 개인위치정보를 수집한 스마트폰 등으로 사용자에게 개인위치정보를 제공받는 자, 제공 일시 및 제공 목적을 즉시 통보하겠습니다. 의무자는 개인위치정보주체의 권리를 모두 행사할 수 있습니다. 오드는 사용자의 위치정보를 안전하게 보호하기 위하여 위치 정보관리책임자(박장훈 대표, deso@oddhem.com)를 지정하고 있습니다. 만약 사용자와 오드 간의 위치정보와 관련한 분쟁에 대하여 협의가 어려운 때에는 사용자은 위치정보의 보호 및 이용 등 에 관한 법률 제 28조 2항 및 개인정보보호법 제43조의 규정 에 따라 개인정보 분쟁조정위원회에 조정을 신청할 수 있습니다.

    제21조(부칙)

    - 본 약관은 2022년 10월 15일부터 적용됩니다. 

    - 본 약관은 타 약관보다 우선하며, 본 약관 제2조의 정의는 모든 약관에 적용됩니다. 

    - 회사가 직접 제공하는 사이트 이외에 링크된 사이트에서는 모든 약관이 적용되지 않습니다. 

    - 본 약관에 명시되어 있지 않은 사항은 관련 법령을 따릅니다."`,
    //-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    `   개인정보처리방침

    개인정보 수집 및 이용 안내

    오 드 (이하 “회사”)는 회원님의 개인정보를 보호하기 위해 최선을 다하고 있습니다. 이를 위해서 회사는 개인정보의 보호와 관련하여 ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률’, ‘개인정보 보호법’ 등 개인정보와 관련된 법령을 준수하고 있습니다.
    
    1. 수집하는 개인정보의 항목

    회사는 이름, 이메일, 나이, 성별, 서비스 이용기록, 결제 및 환불 기록, 생년월일, 휴대폰번호, 관심분야 등에 관한 정보를 수집합니다.

    서비스를 이용하는 과정에서 방문일시, 사용이력, 기기정보, 접속로그, IP주소 등이 자동으로 생성·수집 될 수 있습니다.
    
    회사는 회원가입, 구매 등 서비스 제공을 위한 최소한의 범위 내에서 이용자의 동의 하에 개인정보를 수집하며, 수집한 모든 개인정보는 고지한 목적 범위 내에서만 이용됩니다.
    
    1) 회원 가입 시
    
    - (필수) 아이디(E-MAIL), 비밀번호, 휴대폰번호, 닉네임
    
    - (선택) 생년월일, 성별, 연계정보(CI), 프로필 사진
    
    2) 상품 구매 시
    
    - (필수) 핸드폰번호, 신용카드 정보, 은행계좌 정보, 결제기록 등의 정보
    
    - (선택) 배송지 정보: 수령인, 연락처, 주소지
    
    - (선택) 탑승자 이름, 동반인정보(성명, 이외 서비스의 유형에 따라, 추가적인 정보가 수집될 수 있습니다. (여행상품)
    
    4) 모바일 사용 시
    
    - DESO 앱 버전, OS버전 (iOS, 안드로이드)
    
    - 위치정보 (별도 저장없이 앱에서 사용)
    
    5) 기타
    
    - 서비스 이용과정에서 자동 수집 정보 : 회원ID, IP Address, 쿠키, 방문 일시, 서비스 이용 기록, 불량 이용 기록, 기기정보, ADID, IDFA, 위치정보
    
    -고객 분쟁처리 및 상담 진행 시 : 상담내역, 채팅(대화)내역, 서비스 이용기록, 결제 및 환불 기록
    
    2. 개인정보의 수집 및 이용목적
    
    회사는 회원의 식별·확인, 회원가입 의사 확인, 중복가입 여부 확인, 만14세 미만 여부 확인, 법정대리인의 동의 처리, 계약의 체결·이행·관리, 주문상품의 배송 상태 통지, 결제 및 환불, 통계분석, 구매 성향 분석, 서비스 개선, 민원 기타 문의 사항 처리, 부정이용에 대한 조사 및 대응, 고지사항 전달, 청구서 등의 발송, 법령상 의무 이행, 사은/판촉행사 등 각종 이벤트, 개인 맞춤형 서비스 제공, 새로운 상품 기타 행사 관련 정보 안내 및 마케팅 활동, 이메일 초대권 활용 내역 조회, 회사 및 제휴사 상품/서비스 안내 및 권유의 목적으로 개인정보를 이용합니다.
    
    3. 개인정보 수집 방법
    
    회사는 홈페이지, 어플리케이션, 고객센터, 게시판, 이벤트 참여, 제휴사로부터의 전달 등을 통해 개인정보를 수집합니다. 이용자는 회사가 마련한 개인정보 처리 동의서에 대해 「동의」 버튼을 클릭함으로써 개인정보 처리에 대하여 동의 여부를 표시할 수 있습니다.
    
    4. 개인정보의 보유 및 이용기간
    
    귀하가 제공한 개인정보는 법령에서 별도로 정하거나 귀하와 별도 합의하는 등의 특별한 사정이 없는 한 회사가 제공하는 서비스를 받는 동안 또는 위에서 정한 목적을 달성할 때까지 회사가 보유ㆍ이용하게 됩니다. 회사는 관련 법령(아래의 경우에 한정되지 않습니다)의 규정에 의하여 보존하여야 하는 기록은 일정 기간 보관 후 파기합니다.
    
    가. 계약 또는 청약철회 등에 관한 기록 (보존기간 : 5년) : 전자상거래 등에서의 소비자 보호에 관한 법률
    
    나. 대금결제 및 재화 등의 공급에 관한 기록 (보존기간 : 5년) : 전자상거래 등에서의 소비자 보호에 관한 법률
    
    다. 소비자의 불만 또는 분쟁처리에 관한 기록 (보존기간 : 3년) : 전자상거래 등에서의 소비자 보호에 관한 법률
    
    라. 홈페이지 방문에 관한 기록 (보존 기간: 3개월) : 통신비밀보호법
    
    5. 개인정보 제 3자 제공
    
    회사는 계약의 이행을 위하여 최소한의 개인정보만 제공하고 있으며, 개인정보를 제3자에게 제공해야 하는 경우 사전에 이용자에게 해당 사실을 알리고 동의를 구하도록 하겠습니다. 다만 다음의 경우는 예외로 하고 있습니다.
    
    가. 서비스 제공에 따른 요금정산을 위해 필요한 경우
    
    나. 법령의 규정에 의한 경우
    
    다. 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우 회사가 제공하는 서비스를 통하여 주문 및 결제가 이루어진 경우 상담 등 거래 당사자간 원활한 의사소통 및 발송 등 거래이행을 위하여 관련된 정보를 필요한 범위 내에서 거래 당사자에게 제공합니다.
    
    제공받는 자 : 호스트
    
    제공하는 항목 : 이름, 성별, 나이, 연락처, 의류 사이즈, 배송지 정보(수령인, 연락처, 주소지) 등 개별 프로그램별로 필요하여 회원이 입력한 정보
    
    제공받는 자의 이용목적 : 본인 확인, 프로그램 준비 및 이행, 민원처리, 상품(서비스), 발송(전송), 제품 설치, 반품, 환불, 고객상담 등 정보통신서비스제공계약 및 전자상거래(통신판매) 계약의 이행을 위해 필요한 업무
    
    보유 및 이용기간 : 상품 및 서비스 제공 완료 후 6개월
    
    제공받는 자 : 회원
    
    제공하는 항목 : 호스트명, 이름, 연락처, 주소, 집결지 등 호스트가 입력한 정보
    
    제공받는 자의 이용목적 : 본인 확인, 프로그램 준비 및 이행, 민원처리, 상품(서비스), 발송(전송), 제품 설치, 반품, 환불, 고객상담 등 정보통신서비스제공계약 및 전자상거래(통신판매) 계약의 이행을 위해 필요한 업무
    
    보유 및 이용기간 : 상품 및 서비스 제공 완료 후 6개월
    
    6. 개인정보의 처리 위탁
    
    회사는 서비스 향상을 위해서 아래와 같이 개인정보를 위탁하고 있으며, 관계 법령에 따라 위탁계약 시 개인정보가 안전하게 관리될 수 있도록 필요한 사항을 규정하고 있습니다. 수탁자 및 수탁업무 내용은 아래와 같습니다.
    
    수탁자 : 나이스페이, 다날, 아임포트, 페이코, 토스
    
    수탁업무 : 결제
    
    수탁자 : 다날
    
    수탁업무 : 본인확인
    
    수탁자 : braze
    
    수탁업무 : 마케팅 자동화 솔루션
    
    수탁자 : Sendbird
    
    수탁업무 : 고객 상담(대화 내용)
    
    수탁자 : AWS
    
    수탁업무 : 서버 및 데이터베이스 보관
    
    7. 이용자의 권리
    
    회사는 이용자(만 14세 미만자인 경우에는 법정대리인)의 권리를 다음과 같이 보호하고 있습니다.
    
    가. 이용자는 언제든지 자신의 개인정보 또는 법정대리인의 경우 만 14세 미만자의 개인정보를 조회하고 수정하는 등 법령이 정한 권리를 행사할 수 있습니다.
    
    나. 이용자는 언제든지 개인정보 처리의 정지를 요청할 수 있으며, 법률에 특별한 규정이 있는 등의 경우에는 처리정지 요청을 거부할 수 있습니다.
    
    다. 이용자는 언제든지 ‘회원탈퇴’등을 통해 개인정보의 수집 및 이용 동의를 철회할 수 있습니다.
    
    라. 개인정보의 수정을 요청하는 경우 회사는 정확한 개인정보의 이용 및 제공을 위해 수정이 완료될 때까지 이용자의 개인정보는 이용하거나 제공하지 않습니다.
    
    8. 개인정보 파기절차 및 방법
    
    회사는 원칙적으로 이용자의 개인정보를 회원 탈퇴 시 지체없이 파기하고 있습니다.
    단, 4. 개인정보의 보유 및 이용기간에 따라 이용자에게 개인정보 보관기간에 대해 별도의 동의를 얻은 경우, 또는 법령에서 일정 기간 정보보관 의무를 부과하는 경우에는 해당 기간 동안 개인정보를 안전하게 보관합니다.
    회원탈퇴, 서비스 종료, 이용자에게 동의받은 개인정보 보유기간의 도래와 같이 개인정보의 수집 및 이용목적이 달성된 개인정보는 재생이 불가능한 방법으로 파기하고 있습니다. 법령에서 보존의무를 부과한 정보에 대해서도 해당 기간 경과 후 지체없이 재생이 불가능한 방법으로 파기합니다.
    전자적 파일 형태의 경우 복구 및 재생이 되지 않도록 기술적인 방법을 이용하여 안전하게 삭제하며, 출력물 등은 분쇄하거나 소각하는 방식 등으로 파기합니다.
    
    9. 개인정보보호를 위한 기술적·관리적 조치
    
    회사는 이용자의 개인정보를 처리함에 있어 정보의 분실, 도난, 누출, 외부로부터의 공격, 해킹 등을 방지하고 최상의 안전성을 확보하기 위하여 다음 각호의 방식을 포함하여 법령에서 정한 보호조치를 취하고 있습니다.
    
    가. 이용자의 개인정보는 비밀번호에 의해 보호되며, 파일 및 전송 데이터를 암호화하여 중요한 데이터는 별도의 보안기능을 통해 보호되고 있습니다.
    
    나. 회사는 컴퓨터 바이러스에 의한 피해가 발생하지 않도록 백신프로그램을 이용하고 있으며, 백신프로그램에 대한 주기적인 업데이트하고 있습니다.
    
    다. 회사는 암호 알고리즘을 이용하여 네트워크 상의 개인정보를 안전하게 전송할 수 있는 보안장치를 채택하고 있습니다.
    
    라. 해킹 등에 의해 이용자의 개인정보가 유출되는 것을 방지하기 위해, 외부침입을 차단하는 보안장치를 이용하고 있으며, 침입탐지시스템을 설치하여 불법적인 침입을 감시하고 있습니다.
    
    마. 이용자의 개인정보를 처리하는 담당인원을 최소한으로 제한하며, 관련 직원에 대해서는 지속적인 보안교육의 실시와 함께 본 정책의 준수여부를 수시로 점검하고 있습니다.
    
    10. 개인정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항
    
    회사는 이용자의 정보를 자동으로 저장하고 찾아내는 ‘쿠키(cookie)’ 등을 운용합니다. 쿠키란 웹사이트를 운영하는데 이용되는 서버가 귀하의 브라우저에 보내는 아주 작은 텍스트 파일로서 귀하의 컴퓨터 하드디스크에 저장됩니다.
    
    가. 쿠키 등 사용 목적
    
    로그인 식별/고객님의 사용 기록/기존 홈페이지 방문 또는 앱 사용 회수 파악 등을 통한 개인 맞춤 서비스 제공 등을 위해 쿠키를 운용합니다. 이용자는 쿠키 설치에 대한 선택권을 가지고 있습니다.
    
    나. 쿠키 설정 거부 방법
    
    쿠키 설정을 거부하는 방법으로는 회원님이 사용하시는 앱이나 웹 브라우저의 옵션을 선택함으로써 모든 쿠키를 허용하거나 쿠키를 저장할 때마다 확인을 거치거나, 모든 쿠키의 저장을 거부할 수 있습니다.
    
    11. 홈페이지 개인정보 보호책임자
    
    회사는 이용자의 개인정보에 대한 개인정보 보호책임자를 지정하여 개인정보보호를 위해 최선을 다하겠습니다. 현재 회사의 개인정보 보호책임자는 아래와 같습니다.
    
    - 성명 : 박 장 훈
    
    - 소속 : 기획전략팀
    
    - 직위 : CEO
    
    - E-mail : deso@oddhem.com
    
    - 연락처 : 070-7181-3677
    
    개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.
    
    ▶ 개인정보 침해신고센터
    
    - 홈페이지 : privacy.kisa.or.kr
    
    - 연락처 : (국번없이) 118, privacy@kisa.or.kr
    
    - 주소 : (05717) 서울시 송파구 중대로 135 (가락동 78) IT벤처타워 한국인터넷진흥원 개인정보침해신고센터
    
    ▶ 대검찰청 사이버범죄수사단 : 02-3480-3573 (www.spo.go.kr)
    
    ▶ 경찰청 사이버안전국 : (경찰청 대표)182 (www.netan.go.kr)

    
    12. 개인정보처리방침의 적용 제외
    
    회사는 이용자에게 홈페이지를 통하여 다른 회사의 웹사이트 또는 자료에 대한 링크를 제공할 수 있습니다. 이 경우 회사는 외부사이트 및 자료에 대하여 통제권이 없을 뿐만 아니라 이들이 개인정보를 수집하는 행위에 대하여 회사의 '개인정보처리방침'이 적용되지 않습니다. 따라서, 회사가 포함하고 있는 링크를 클릭하여 타 사이트의 페이지로 이동할 경우에는 새로 방문한 사이트의 개인정보처리방침을 반드시 확인하시기 바랍니다.
    
    13. 시행시기
    
    본 개인정보처리방침은 2022년 10월 22일부터 시행됩니다.`,
  ];

  return tos[num];
}

export default TOS;
